In [55]:
import numpy as np

In [3]:
arr = np.random.randn(3,5)
arr

array([[ 0.75663337, -0.68619708, -1.59977064, -0.09050398, -0.72455802],
       [ 0.47806253, -1.51399443,  0.17391022,  1.14385979,  0.26754446],
       [-0.29059446, -0.14803879, -0.83096088, -0.3464901 ,  0.0956119 ]])

In [4]:
type(arr)

numpy.ndarray

In [5]:
arr.dtype

dtype('float64')

In [6]:
print(np.zeros(5))

[0. 0. 0. 0. 0.]

In [10]:
print(np.eye(5,8,2))

[[0. 0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 0. 1. 0.]]

In [13]:
print(np.diag(np.eye(5,8)))

[1. 1. 1. 1. 1.]

In [15]:
print(np.arange(6,23,2.5))

[ 6.   8.5 11.  13.5 16.  18.5 21. ]

In [16]:
fun=lambda x,y : x+y
print(np.fromfunction(fun,(4,4)))

[[0. 1. 2. 3.]
 [1. 2. 3. 4.]
 [2. 3. 4. 5.]
 [3. 4. 5. 6.]]

In [18]:
fun=lambda x,y : x+y
print(np.sum(np.fromfunction(fun,(4,4))))

48.0

In [19]:
fun=lambda x,y : x+y
arr=(np.fromfunction(fun,(4,4)))

In [20]:
arr[2][3]

5.0

In [21]:
arr[2,3]

5.0

In [23]:
countries=np.array(['India','USA','Australia','Greece','Bhutan'])
data=np.array([[1,2,3],[2,3,40],[23,43,21],[0,5,0],[5,5,5]])

In [24]:
countries=='India'

array([ True, False, False, False, False])

In [27]:
data[[ True, False, False, False, False]]

array([[1, 2, 3]])

In [29]:
data[countries=='USA']

array([[ 2,  3, 40]])

In [30]:
np.linspace(20,30)

array([20.        , 20.20408163, 20.40816327, 20.6122449 , 20.81632653,
       21.02040816, 21.2244898 , 21.42857143, 21.63265306, 21.83673469,
       22.04081633, 22.24489796, 22.44897959, 22.65306122, 22.85714286,
       23.06122449, 23.26530612, 23.46938776, 23.67346939, 23.87755102,
       24.08163265, 24.28571429, 24.48979592, 24.69387755, 24.89795918,
       25.10204082, 25.30612245, 25.51020408, 25.71428571, 25.91836735,
       26.12244898, 26.32653061, 26.53061224, 26.73469388, 26.93877551,
       27.14285714, 27.34693878, 27.55102041, 27.75510204, 27.95918367,
       28.16326531, 28.36734694, 28.57142857, 28.7755102 , 28.97959184,
       29.18367347, 29.3877551 , 29.59183673, 29.79591837, 30.        ])

In [31]:
np.linspace(20,30,10)

array([20.        , 21.11111111, 22.22222222, 23.33333333, 24.44444444,
       25.55555556, 26.66666667, 27.77777778, 28.88888889, 30.        ])

In [33]:
arr1=np.array([[1,2,3],[10,20,30]])
arr2=np.array([[5,5,5],[10,10,10]])
np.concatenate((arr1,arr2))

array([[ 1,  2,  3],
       [10, 20, 30],
       [ 5,  5,  5],
       [10, 10, 10]])

In [34]:
np.concatenate((arr1,arr2),axis=1)

array([[ 1,  2,  3,  5,  5,  5],
       [10, 20, 30, 10, 10, 10]])

In [37]:
np.intersect1d(arr1,arr2)

array([10])

In [38]:
np.stack((arr1,arr2))

array([[[ 1,  2,  3],
        [10, 20, 30]],

       [[ 5,  5,  5],
        [10, 10, 10]]])

In [40]:
np.stack((arr1,arr2),axis=1)

array([[[ 1,  2,  3],
        [ 5,  5,  5]],

       [[10, 20, 30],
        [10, 10, 10]]])

In [41]:
np.ndim(np.stack((arr1,arr2)))

3

In [44]:
np.shape(np.stack((arr1,arr2)))

(2, 2, 3)

In [45]:
arr=np.arange(1,10)

In [46]:
for i in arr:
    print(i)

1
2
3
4
5
6
7
8
9

In [1]:
import pandas as pd

In [3]:
s1=pd.Series([1,2,3,4,5])

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
val=s1.values
type(val)

numpy.ndarray

In [6]:
val

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
ind=s1.index

In [8]:
ind

RangeIndex(start=0, stop=5, step=1)

In [9]:
s1[s1>2]

2    3
3    4
4    5
dtype: int64

In [10]:
s1+10

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [11]:
11 in s1

False

In [12]:
2 in s1

True

In [13]:
s1.isnull()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [14]:
s1.notnull()

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [18]:
dct={'name': ['Prateek','Simmi','Madhav'],'age':[37,36,3],'gender':['male',"female","male"]}
df=pd.DataFrame(dct,index=['a','b','c'])
df

      name  age  gender
a  Prateek   37    male
b    Simmi   36  female
c   Madhav    3    male

In [22]:
df=pd.DataFrame([[1,2,3],[10,20,30],[100,200,300]],columns=['ones','tens','hundred'],index=['a','b','c'])
df

   ones  tens  hundred
a     1     2        3
b    10    20       30
c   100   200      300

In [23]:
df['ones']

a      1
b     10
c    100
Name: ones, dtype: int64

In [24]:
df['ones'][1]

10

In [27]:
df.loc['b']

ones       10
tens       20
hundred    30
Name: b, dtype: int64

In [28]:
df['thousands']=[1000,2000,3000]
df

   ones  tens  hundred  thousands
a     1     2        3       1000
b    10    20       30       2000
c   100   200      300       3000

In [29]:
del df['thousands']

In [30]:
df

   ones  tens  hundred
a     1     2        3
b    10    20       30
c   100   200      300

In [31]:
df.ones

a      1
b     10
c    100
Name: ones, dtype: int64

In [33]:
df['filter']=df.hundred>10
df

   ones  tens  hundred  filter
a     1     2        3   False
b    10    20       30    True
c   100   200      300    True

In [34]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
df.columns

Index(['ones', 'tens', 'hundred', 'filter'], dtype='object')

In [36]:
df.values

array([[1, 2, 3, False],
       [10, 20, 30, True],
       [100, 200, 300, True]], dtype=object)

In [39]:
df

   ones  tens  hundred  filter
a     1     2        3   False
b    10    20       30    True
c   100   200      300    True

In [43]:
df.drop('b',axis=0)

   ones  tens  hundred  filter
a     1     2        3   False
c   100   200      300    True

In [44]:
df.size

12

In [46]:
df.describe()

             ones        tens     hundred
count    3.000000    3.000000    3.000000
mean    37.000000   74.000000  111.000000
std     54.744863  109.489726  164.234588
min      1.000000    2.000000    3.000000
25%      5.500000   11.000000   16.500000
50%     10.000000   20.000000   30.000000
75%     55.000000  110.000000  165.000000
max    100.000000  200.000000  300.000000

In [50]:
df.info

<bound method DataFrame.info of    ones  tens  hundred  filter
a     1     2        3   False
b    10    20       30    True
c   100   200      300    True>

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ones     3 non-null      int64
 1   tens     3 non-null      int64
 2   hundred  3 non-null      int64
 3   filter   3 non-null      bool
dtypes: bool(1), int64(3)
memory usage: 207.0+ bytes

In [51]:
df.head(2)

   ones  tens  hundred  filter
a     1     2        3   False
b    10    20       30    True

In [52]:
np.select ?

SyntaxError: invalid syntax (<ipython-input-52-6b9c7efdf568>, line 1)

In [71]:
arr=np.arange(8)
arr

array([0, 1, 2, 3, 4, 5, 6, 7])

In [78]:
cond=[arr<3,arr>=6]

In [79]:
cond

[array([ True,  True,  True, False, False, False, False, False]),
 array([False, False, False, False, False, False,  True,  True])]

In [80]:
a=[4,4,4,4,4,4,4,4]
choice=[arr,a]
choice

[array([0, 1, 2, 3, 4, 5, 6, 7]), [4, 4, 4, 4, 4, 4, 4, 4]]

In [81]:
final=np.select(cond,choice)
final

array([0, 1, 2, 0, 0, 0, 4, 4])

In [82]:
dct={'name': ['Prateek','Simmi','Madhav'],'age':[37,36,3],'gender':['male',"female","male"]}
df=pd.DataFrame(dct,index=['a','b','c'])
df

      name  age  gender
a  Prateek   37    male
b    Simmi   36  female
c   Madhav    3    male

In [89]:
cond=[df['gender']=='male',
      df['gender']=='female'
     ]

selection=['football',
           'badminton'
          ]

df['sport']=np.select(cond,selection)
df

      name  age  gender      sport
a    Simmi   36  female  badminton
b   Madhav    3    male   football
c  Prateek   37    male   football

In [90]:
df.index=['c','a','b']
df

      name  age  gender      sport
c    Simmi   36  female  badminton
a   Madhav    3    male   football
b  Prateek   37    male   football

In [91]:
df.sort_index(inplace=True)
df

      name  age  gender      sport
a   Madhav    3    male   football
b  Prateek   37    male   football
c    Simmi   36  female  badminton

In [92]:
df.sort_values(by='age')

      name  age  gender      sport
a   Madhav    3    male   football
c    Simmi   36  female  badminton
b  Prateek   37    male   football

In [108]:
df=df.T
df

      name age  gender      sport
a   Madhav   3    male   football
b  Prateek  37    male   football
c    Simmi  36  female  badminton

In [109]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [110]:
df.stack()

a  name         Madhav
   age               3
   gender         male
   sport      football
b  name        Prateek
   age              37
   gender         male
   sport      football
c  name          Simmi
   age              36
   gender       female
   sport     badminton
dtype: object

In [111]:
df[df['gender']=='male']

      name age gender     sport
a   Madhav   3   male  football
b  Prateek  37   male  football

In [112]:
df['gender'][1]

'male'

In [113]:
df

      name age  gender      sport
a   Madhav   3    male   football
b  Prateek  37    male   football
c    Simmi  36  female  badminton

In [114]:
3132-2698

434

In [117]:
print(df.iterrows())

<generator object DataFrame.iterrows at 0x0000025A824237B0>

In [118]:
df.iteritems()

In [119]:
df.iterrows

<bound method DataFrame.iterrows of       name age  gender      sport
a   Madhav   3    male   football
b  Prateek  37    male   football
c    Simmi  36  female  badminton>

In [120]:
df.iteritems

<bound method DataFrame.iteritems of       name age  gender      sport
a   Madhav   3    male   football
b  Prateek  37    male   football
c    Simmi  36  female  badminton>

In [126]:
for index,row in df.iterrows():
    print(index,row)

a name        Madhav
age              3
gender        male
sport     football
Name: a, dtype: object
b name       Prateek
age             37
gender        male
sport     football
Name: b, dtype: object
c name          Simmi
age              36
gender       female
sport     badminton
Name: c, dtype: object

In [127]:
for index,col in df.iteritems():
    print(index, col)

name a     Madhav
b    Prateek
c      Simmi
Name: name, dtype: object
age a     3
b    37
c    36
Name: age, dtype: object
gender a      male
b      male
c    female
Name: gender, dtype: object
sport a     football
b     football
c    badminton
Name: sport, dtype: object

<ipython-input-127-6881fcc2b12c>:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for index,col in df.iteritems():

In [128]:
dct=df.to_dict()
dct

{'name': {'a': 'Madhav', 'b': 'Prateek', 'c': 'Simmi'},
 'age': {'a': 3, 'b': 37, 'c': 36},
 'gender': {'a': 'male', 'b': 'male', 'c': 'female'},
 'sport': {'a': 'football', 'b': 'football', 'c': 'badminton'}}

In [182]:
df['age2']=df['age'].apply(lambda x : x*2)
df

      name age  gender      sport status status2  age3  age2
a   Madhav   3    male   football  Child   child    30     6
b  Prateek  37    male   football  Adult   Adult   370    74
c    Simmi  36  female  badminton  Adult   Adult   360    72

In [183]:
df.sort_values(by='age')

      name age  gender      sport status status2  age3  age2
a   Madhav   3    male   football  Child   child    30     6
c    Simmi  36  female  badminton  Adult   Adult   360    72
b  Prateek  37    male   football  Adult   Adult   370    74

In [184]:
a=np.array([0,1,2,3,4,5,6,7,8,9])
b=np.array([10,11,12,13,14,15,16,17,18,19])
c=a*b
c

array([  0,  11,  24,  39,  56,  75,  96, 119, 144, 171])

In [185]:
from time import time

def fun1(x):
    return x*10

fun2 = np.vectorize(fun1)
s=time()
df['age3']=df['age'].apply(fun2)
# fun2(df['age'])
e=time()
print(e-s)

0.0

In [186]:
s=time()
df['age3']=df['age'].apply(fun1)
e=time()
print(e-s)

0.001001596450805664

In [187]:
x=np.where(df['age']>3)
df

      name age  gender      sport status status2  age3  age2
a   Madhav   3    male   football  Child   child    30     6
b  Prateek  37    male   football  Adult   Adult   370    74
c    Simmi  36  female  badminton  Adult   Adult   360    72

In [188]:
x

(array([1, 2], dtype=int64),)

In [189]:
df.iloc[x]

      name age  gender      sport status status2  age3  age2
b  Prateek  37    male   football  Adult   Adult   370    74
c    Simmi  36  female  badminton  Adult   Adult   360    72

In [190]:
df['status']=np.where(df['age']>18,
                     'Adult',
                     'Child')
df

      name age  gender      sport status status2  age3  age2
a   Madhav   3    male   football  Child   child    30     6
b  Prateek  37    male   football  Adult   Adult   370    74
c    Simmi  36  female  badminton  Adult   Adult   360    72

In [191]:
cond=[(df['age']>18),(df['age']<18)]
select=['Adult','child']

df['status2']=np.select(cond,select)
df

      name age  gender      sport status status2  age3  age2
a   Madhav   3    male   football  Child   child    30     6
b  Prateek  37    male   football  Adult   Adult   370    74
c    Simmi  36  female  badminton  Adult   Adult   360    72

In [192]:
df.drop(['status2','status','age2','age3'],inplace=True,axis='columns')

In [197]:
df.pivot(index=['age'],columns=['sport','name'],values='gender')

<ipython-input-197-90f707db817f>:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df.pivot(index=['age'],columns=['sport','name'],values='gender')

sport football         badminton
name    Madhav Prateek     Simmi
age
3         male     NaN       NaN
36         NaN     NaN    female
37         NaN    male       NaN

In [204]:
for i in df.itertuples():
    print(i)
    print(i[1])
    print(type(i))

Pandas(Index='a', name='Madhav', age=3, gender='male', sport='football')
Madhav
<class 'pandas.core.frame.Pandas'>
Pandas(Index='b', name='Prateek', age=37, gender='male', sport='football')
Prateek
<class 'pandas.core.frame.Pandas'>
Pandas(Index='c', name='Simmi', age=36, gender='female', sport='badminton')
Simmi
<class 'pandas.core.frame.Pandas'>

In [206]:
df.columns.unique()

Index(['name', 'age', 'gender', 'sport'], dtype='object')

In [207]:
df.pivot(index=['age'],columns=['sport','name'],values='gender').fillna(0)

<ipython-input-207-62cf5a863f0f>:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df.pivot(index=['age'],columns=['sport','name'],values='gender').fillna(0)

sport football         badminton
name    Madhav Prateek     Simmi
age
3         male       0         0
36           0       0    female
37           0    male         0

In [213]:
df

      name age  gender      sport
a   Madhav   3    male   football
b  Prateek  37    male   football
c    Simmi  36  female  badminton

In [216]:
df.groupby(['gender']).sum()

                 name  age             sport
gender
female          Simmi   36         badminton
male    MadhavPrateek   40  footballfootball

In [217]:
df.groupby(['gender'])['age'].sum()

gender
female    36
male      40
Name: age, dtype: object